InformationRegisters/РазмерыВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РазмерыВычетовИПН</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПределаВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПределовВычетовИКорректировокДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидВычетаИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВычетыИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПределовВычетовИКорректировокДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыПределовВычетовИКорректировокДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МЗП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РазмерыВычетовИПН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьРазмерыВычетовИПН();
	
КонецПроцедуры

Процедура ЗаполнитьРазмерыВычетовИПН()
	
	НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();

	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.Стандартный1МЗП, 	  Перечисления.ВидыПределовВычетовИКорректировокДоходов.МЗП, 1);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.НаОплатуМедицинскихУслуг, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 94);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.Стандартный75МЗПИнвалиды, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВычетыИПН.Стандартный75МЗПРодители, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20220101', Справочники.ВычетыИПН.Стандартный1МЗП, 		  Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 14);
    
    НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерВычетаИПН(НаборЗаписей, Период, ВидВычетаИПН, ВидПределаВычета, Размер) Экспорт
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидВычетаИПН = ВидВычетаИПН;
	НоваяЗапись.ВидПределаВычета = ВидПределаВычета;
	НоваяЗапись.Размер = Размер;
	
КонецПроцедуры	

Процедура ОбновитьРазмерыВычетовИПН2022() Экспорт
	
	ДобавитьРазмерВычетаИПНСПроверкой('20220101', Справочники.ВычетыИПН.Стандартный1МЗП, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 14);  

КонецПроцедуры

Процедура ДобавитьРазмерВычетаИПНСПроверкой(Период, ВидВычетаИПН, ВидПределаВычета, Размер) 
	
	НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Отбор.ВидВычетаИПН.Установить(ВидВычетаИПН, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.ВидВычетаИПН = ВидВычетаИПН;
		// Ресурсы
		Движение.ВидПределаВычета = ВидПределаВычета;
		Движение.Размер = Размер;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
